[
    {
        "name": "Rainbow Lorikeet",
        "type": "Birds",
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Rainbow_Lorikeet_-_AndrewMercer_IMG08212.jpg/800px-Rainbow_Lorikeet_-_AndrewMercer_IMG08212.jpg",
        "desc": "The rainbow lorikeet was formally listed in 1788 by the German naturalist Johann Friedrich Gmelin under the binomial name Psittacus moluccanus. Gmelin cited the French polymath Georges-Louis Leclerc, Comte de Buffon who in 1779 had published a description of 'La Perruche à Face Bleu' in his Histoire Naturelle des Oiseaux. The species was illustrated as the 'Peluche des Moluques' and as the 'Perruche d'Amboine'.Gmelin was misled and coined the specific epithet moluccanus as he believed the specimens had come from the Moluccas. The type locality was changed to Botany Bay in Australia by Gregory Mathews in 1916.[10][11] The rainbow lorikeet is now placed in the genus Trichoglossus that was introduced in 1826 by the English naturalist James Francis Stephens",
        "desc2": "The rainbow lorikeet has often included the red-collared lorikeet (T. rubritorquis) as a subspecies, but today most major authorities consider it separate. Additionally, a review in 1997 led to the recommendation of splitting off some of the most distinctive taxa from the Lesser Sundas as separate species, these being the scarlet-breasted lorikeet (T. forsteni), the marigold lorikeet (T. capistratus) and the Flores lorikeet (T. weberi).[16] This is increasingly followed by major authorities. In 2019 The rainbow lorikeet in Australia was split into three: rainbow, coconut (Trichoglossus haematodus) and red-collared lorikeets (Trichoglossus rubritorquis).",
        "desc3": "Three syntypes of Trichoglossus novaehollandiae septentrionalis Robinson (Bull. Liverpool Mus., 2, 1900, p.115) are held in the vertebrate zoology collection of National Museums Liverpool at World Museum, with accession numbers NML-VZ 23.7.1900.4, NML-VZ 23.7.1900.4a, and NML-VZ 23.7.1900.4b.[18] The specimens were collected in Cooktown, Queensland, Australia by E. Olive. The specimens came to the Liverpool national collection via purchase from H. C. Robinson."
    },
    {
        "name": "Chamelion",
        "type": "Reptiles",
        "image": "https://pngimg.com/uploads/lizard/lizard_PNG20.png",
        "desc": "Chameleons or chamaeleons (family Chamaeleonidae) are a distinctive and highly specialized clade of Old World lizards with 202 species described as of June 2015. The members of this family are most known for their distinct range of colors as they are able to shift in different hues and brightness. Because of the large number of species in their family, there is a large variability in their ability to change color. For some, it is more of a shift of brightness (shades of brown) whereas others it is a plethora of combinations of colors (reds, yellows, greens, and blues).",
        "desc2": "Chameleons are distinguished by their zygodactylous feet, their prehensile tail, their laterally compressed bodies, their head casques, their projectile tongues, their swaying gait, and crests or horns on their brow and snout. Chameleons' eyes are independently mobile, and because of this there are two separate, individual images that the brain is analyzing of the chameleon’s environment. When hunting prey, they focus forward in coordination, affording the animal stereoscopic vision. The eyes are able to move laterally 180° and vertically 160",
        "desc3": "Chameleons are adapted for climbing and visual hunting. The use of their prehensile tail offers stability when they are moving or resting while on a branch in the canopy; because of this, their tail is often referred to as a fifth limb. Another character that is advantageous for being arboreal is how laterally compressed their bodies are; it is important for them to distribute their weight as evenly as possible as it confers stability on twigs and branches in the trees. They live in warm habitats that range from rainforest to desert conditions, with various species occurring in Africa, Madagascar, southern Europe, and across southern Asia as far as Sri Lanka. They have been introduced to Hawaii, California, and Florida"
    },
    {
        "name": "Dart Frog",
        "type": "Amphibians",
        "image": "https://www.animalspot.net/wp-content/uploads/2022/02/Blue-Poison-Dart-Frog.jpg",
        "desc": "A frog is any member of a diverse and largely carnivorous group of short-bodied, tailless amphibians composing the order Anura (Ancient Greek an-, without + oura, tail). The oldest fossil 'proto-frog' appeared in the early Triassic of Madagascar, but molecular clock dating suggests their origins may extend further back to the Permian, 265 million years ago. Frogs are widely distributed, ranging from the tropics to subarctic regions, but the greatest concentration of species diversity is in tropical rainforests. There are approximately 4,800 recorded species, accounting for over 85% of extant amphibian species. They are also one of the five most diverse vertebrate orders.",
        "desc2": "The body plan of an adult frog is generally characterized by a stout body, protruding eyes, cleft tongue, limbs folded underneath, and the absence of a tail in adults. Besides living in fresh water and on dry land, the adults of some species are adapted for living underground or in trees. The skin of the frog is glandular, with secretions ranging from distasteful to toxic. Warty species of frog tend to be called toads but the distinction between frogs and toads is based on informal naming conventions concentrating on the warts rather than taxonomy or evolutionary history; some toads are more closely related to frogs than to other toads. Frogs' skins vary in colour from well-camouflaged dappled brown, grey and green to vivid patterns of bright red or yellow and black to advertise toxicity and warn off predators.",
        "desc3": "Frogs typically lay their eggs in water. The eggs hatch into aquatic larvae called tadpoles that have tails and internal gills. They have highly specialized rasping mouth parts suitable for herbivorous, omnivorous or planktivorous diets. The life cycle is completed when they metamorphose into adults. A few species deposit eggs on land or bypass the tadpole stage. Adult frogs generally have a carnivorous diet consisting of small invertebrates, but omnivorous species exist and a few feed on fruit. Frogs are extremely efficient at converting what they eat into body mass. They are an important food source for predators and part of the food web dynamics of many of the world's ecosystems. The skin is semi-permeable, making them susceptible to dehydration, so they either live in moist places or have special adaptations to deal with dry habitats. Frogs produce a wide range of vocalizations, particularly in their breeding season, and exhibit many different kinds of complex behaviours to attract mates, to fend off predators and to generally survive."
    },
    {
        "name": "Katanga Lion",
        "type": "Mammals",
        "image": "https://st2.depositphotos.com/3651755/9808/i/950/depositphotos_98081290-stock-photo-lion-in-africa.jpg",
        "desc": "The lion (Panthera leo) is one of the big cats in the genus Panthera and a member of the family Felidae. The commonly used term African lion collectively denotes the several subspecies in Africa. With some males exceeding 250 kg (550 lb) in weight, it is the second-largest living cat after the tiger. Wild lions currently exist in sub-Saharan Africa and in India (where an endangered remnant population resides in Gir Forest National Park). In ancient historic times, their range was in most of Africa, including North Africa, and across Eurasia from Greece and southeastern Europe to India. In the late Pleistocene, about 10,000 years ago, the lion was the most widespread large land mammal after humans: Panthera leo spelaea lived in northern and western Europe and Panthera leo atrox lived in the Americas from the Yukon to Peru. The lion is classified as a vulnerable species by the International Union for Conservation of Nature (IUCN), having seen a major population decline in its African range of 30–50% over two decades during the second half of the twentieth century.",
        "desc2": "Lion populations are untenable outside designated reserves and national parks. Although the cause of the decline is not fully understood, habitat loss and conflicts with humans are the greatest causes of concern. Within Africa, the West African lion population is particularly endangered.",
        "desc3": "In the wild, males seldom live longer than 10 to 14 years, as injuries sustained from continual fighting with rival males greatly reduce their longevity. In captivity they can live more than 20 years. They typically inhabit savanna and grassland, although they may take to bush and forest. Lions are unusually social compared to other cats. A pride of lions consists of related females and offspring and a small number of adult males. Groups of female lions typically hunt together, preying mostly on large ungulates. Lions are apex and keystone predators, although they are also expert scavengers obtaining over 50 percent of their food by scavenging as opportunity allows. While lions do not typically hunt humans, some have. Sleeping mainly during the day, lions are active primarily at night (nocturnal), although sometimes at twilight (crepuscular)."
    },
    {
        "name": "Arctic Fox",
        "type": "Mammals",
        "image": "https://pngimg.com/uploads/arctic_fox/arctic_fox_PNG41385.png",
        "desc": "The Arctic fox (Vulpes lagopus), also known as the white fox, polar fox, or snow fox, is a small fox native to the Arctic regions of the Northern Hemisphere and common throughout the Arctic tundra biome. It is well adapted to living in cold environments, and is best known for its thick, warm fur that is also used as camouflage. It has a large and very fluffy tail. In the wild, most individuals do not live past their first year but some exceptional ones survive up to 11 years.[9] Its body length ranges from 46 to 68 cm (18 to 27 in), with a generally rounded body shape to minimize the escape of body heat.",
        "desc2": "The Arctic fox preys on many small creatures such as lemmings, voles, ringed seal pups, fish, waterfowl, and seabirds. It also eats carrion, berries, seaweed, and insects and other small invertebrates. Arctic foxes form monogamous pairs during the breeding season and they stay together to raise their young in complex underground dens. Occasionally, other family members may assist in raising their young. Natural predators of the Arctic fox are golden eagles, Arctic wolves, polar bears, wolverines, red foxes, and grizzly bears",
        "desc3": "Arctic foxes must endure a temperature difference of up to 90–100 °C (160–180 °F) between the external environment and their internal core temperature.[14] To prevent heat loss, the Arctic fox curls up tightly tucking its legs and head under its body and behind its furry tail. This position gives the fox the smallest surface area to volume ratio and protects the least insulated areas. Arctic foxes also stay warm by getting out of the wind and residing in their dens. Although the Arctic foxes are active year-round and do not hibernate, they attempt to preserve fat by reducing their locomotor activity.[15][16] They build up their fat reserves in the autumn, sometimes increasing their body weight by more than 50%. This provides greater insulation during the winter and a source of energy when food is scarce."
    },
    {
        "name": "Snake Anaconda",
        "type": "Reptiles",
        "image": "https://pngimg.com/uploads/anaconda/anaconda_PNG13.png",
        "desc": "he green anaconda is the world's heaviest and one of the world's longest snakes, reaching a length of up to 5.21 m (17 ft 1 in) long.[5] More typical mature specimens reportedly can range up to 5 m (16 ft 5 in), with adult females, with a mean length of about 4.6 m (15 ft 1 in), being generally much larger than the males, which average around 3 m (9 ft 10 in). Weights are less well studied, though reportedly range from 30 to 70 kg (66 to 154 lb) in a typical adult.[9][10] It is the largest snake native to the Americas. Although it is slightly shorter than the reticulated python, it is far bulkier; the bulk of a 4.5-metre (14 ft 9 in) green anaconda is comparable to that of a 7.4-metre (24 ft 3 in) reticulated python. Reports of anacondas 11–12 m (35–40 ft) or even longer also exist, but such claims must be regarded with caution, as no specimens of such lengths have ever been deposited in a museum and hard evidence is lacking. A US$50,000 cash reward is on offer for anyone who can catch an anaconda 30 ft (9.14 m) or longer. The longest and heaviest verified specimen encountered by Dr. Jesús Antonio Rivas, who had examined more than a thousand anacondas, was a female 5.21 m (17 ft 1 in) long and weighing 97.5 kg (214 lb 15 oz).",
        "desc2": "The color pattern consists of an olive green background overlaid with black blotches along the length of the body. The head is narrow compared to the body, usually with distinctive orange-yellow striping on either side. The eyes are set high on the head, allowing the snake to see out of the water while swimming without exposing its body. The anaconda’s jaw bones splay open at the front because they are loosely connected. This allows it to swallow prey larger than the size of its head. The windpipe in its mouth allows it to breathe while swallowing its prey. Its largest organ is the liver. The digestion process takes many days to complete and during this time the anaconda behaves very sluggishly.",
        "desc3": "he remote location of the snake's habitat has historically made locating, capturing, and returning specimens difficult. Transporting very large specimens to museums, especially before substantial decay, is difficult (though this has not prevented the return of much larger and more cumbersome crocodilian specimens).[12] Skins can stretch substantially, increasing the snake's size by more than 50% if stretched during the tanning process. Reports without physical proof are considered dubious if from non-scientists, as such individuals may at worst be more interested in promoting themselves or telling a good tale, or at the least may not be sufficiently trained in proper measurement methods. Observational reports of animals which were not captured are even more dubious, as even trained scientists often substantially overestimate the size of anacondas prior to capture."
    },
    {
        "name": "Gray Crow",
        "type": "Birds",
        "image": "https://pngimg.com/uploads/crow/crow_PNG3098.png",
        "desc": "The grey crow (Corvus tristis), formerly known as the bare-faced crow, is about the same size (42–45 cm in length) as the Eurasian carrion crow (Corvus corone) but has somewhat different proportions and quite atypical feather pigmentation during the juvenile phase for a member of this genus.",
        "desc2": "The tail feathers are relatively long and graduated and the legs are relatively short. The overall colouring of the adult bird is black with randomly bleached wing and tail feathers. A large region around the eye is quite bare of feathering and shows pinkish-white skin with the eyes a bluish-white. The bill is unusual too in being very variable, bluish on upper mandible and pinkish-white on the lower in some specimens, while on others the whole bill is pinkish white with a darker tip. The forward pointing nasal bristles so often prominent in other Corvus species are very reduced also.",
        "desc3": "Feeding is both on the ground and in trees taking a very wide range of items. Fruit seems to be very important making up a large percentage of the intake though small animals such as frogs and aquatic insect larvae are taken from shallow water on sand or shingle beds in rivers. When foraging through the trees the birds keep loose, noisy contact with each other and usually number between 4–8 individuals."
    },
    {
        "name": "Sea Lobster",
        "type": "Reptiles",
        "image": "https://pngimg.com/uploads/lobster/lobster_PNG14255.png",
        "desc": "Lobsters have long bodies with muscular tails, and live in crevices or burrows on the sea floor. Three of their five pairs of legs have claws, including the first pair, which are usually much larger than the others. Highly prized as seafood, lobsters are economically important, and are often one of the most profitable commodities in coastal areas they populate.[3]",
        "desc2": "Commercially important species include two species of Homarus (which look more like the stereotypical lobster) from the northern Atlantic Ocean, and scampi (which look more like a shrimp, or a `mini lobster`) — the Northern Hemisphere genus Nephrops and the Southern Hemisphere genus Metanephrops.",
        "desc3": "Lobsters are invertebrates with a hard protective exoskeleton. Like most arthropods, lobsters must shed to grow, which leaves them vulnerable. During the shedding process, several species change color. Lobsters have eight walking legs; the front three pairs bear claws, the first of which are larger than the others. The front pincers are also biologically considered legs, so they belong in the order Decapods ten-footed. Although lobsters are largely bilaterally symmetrical like most other arthropods, some genera possess unequal, specialized claws."
    },
    {
        "name": "Moose Elk",
        "type": "Mammals",
        "image": "https://pngimg.com/uploads/moose/moose_PNG50.png",
        "desc2": "Moose require habitat with adequate edible plants (e.g., pond grasses, young trees and shrubs), cover from predators, and protection from extremely hot or cold weather. Moose travel among different habitats with the seasons to address these requirements. Moose are cold-adapted mammals with thickened skin, dense, heat-retaining coat, and a low surface:volume ratio, which provides excellent cold tolerance but poor heat tolerance. Moose survive hot weather by accessing shade or cooling wind, or by immersion in cool water. In hot weather, moose are often found wading or swimming in lakes or ponds. When heat-stressed, moose may fail to adequately forage in summer and may not gain adequate body fat to survive the winter. Also, moose cows may not calve without adequate summer weight gain. Moose require access to both young forest for browsing and mature forest for shelter and cover. Forest disturbed by fire and logging promotes the growth of fodder for moose. Moose also require access to mineral licks, safe places for calving and aquatic feeding sites.",
        "desc3": " Moose avoid areas with little or no snow as this increases the risk of predation by wolves and avoid areas with deep snow, as this impairs mobility. Thus, moose select habitat on the basis of trade-offs between risk of predation, food availability, and snow depth. With reintroduction of bison into boreal forest, there was some concern that bison would compete with moose for winter habitat, and thereby worsen the population decline of moose. However, this does not appear to be a problem. Moose prefer sub-alpine shrublands in early winter, while bison prefer wet sedge valley meadowlands in early-winter. In late-winter, moose prefer river valleys with deciduous forest cover or alpine terrain above the tree line, while bison preferred wet sedge meadowlands or sunny southern grassy slopes.",
        "desc": "The moose (North America) or elk (Eurasia), Alces alces is a member of the New World deer subfamily and is the largest and heaviest extant species in the Deer family. Moose are distinguished by the broad, palmate (open-hand shaped) antlers of the males; other members of the deer family have antlers with a dendritic configuration. Moose typically inhabit boreal forests and temperate broadleaf and mixed forests of the Northern Hemisphere in temperate to subarctic climates. Hunting and other human activities have caused a reduction in the size of the moose's range over time. Moose have been reintroduced to some of their former habitats. Currently, most moose are found in Canada, Alaska, New England (with Maine having the most of the lower 48 states), Fennoscandia, Baltic states, and Russia. Their diet consists of both terrestrial and aquatic vegetation. The most common moose predators are the gray wolf along with bears and humans. Unlike most other deer species, moose do not form herds and are solitary animals, aside from calves who remain with their mother until the cow begins estrus (typically at 18 months after birth of the calf), at which point the cow chases away young bulls. Although generally slow-moving and sedentary, moose can become aggressive and move quickly if angered or startled. Their mating season in the autumn features energetic fights between males competing for a female."
    },
     {
        "name": "Crocodile",
        "type": "Mammals",
        "image": "https://pngimg.com/uploads/crocodile/crocodile_PNG13179.png",
        "desc2": "Crocodiles (subfamily Crocodylinae) or true crocodiles are large aquatic reptiles that live throughout the tropics in Africa, Asia, the Americas and Australia. Crocodylinae, all of whose members are considered true crocodiles, is classified as a biological subfamily. A broader sense of the term crocodile, Crocodylidae that includes Tomistoma, is not used in this article. The term crocodile here applies only to the species within the subfamily of Crocodylinae. The term is sometimes used even more loosely to include all extant members of the order Crocodilia, which includes Tomistoma, the alligators and caimans (family Alligatoridae), the gharials (family Gavialidae), and all other living and fossil Crocodylomorpha.",
        "desc3": " Although they appear to be similar to the untrained eye, crocodiles, alligators and the gharial belong to separate biological families. The gharial having a narrow snout is easier to distinguish, while morphological differences are more difficult to spot in crocodiles and alligators. The most obvious external differences are visible in the head with crocodiles having narrower and longer heads, with a more V-shaped than a U-shaped snout compared to alligators and caimans. Another obvious trait is that the upper and lower jaws of the crocodiles are the same width, and the teeth in the lower jaw fall along the edge or outside the upper jaw when the mouth is closed; therefore, all teeth are visible unlike an alligator;",
        "desc": "when the crocodile's mouth is closed, the large fourth tooth in the lower jaw fits into a constriction in the upper jaw. For hard-to-distinguish specimens, the protruding tooth is the most reliable feature to define the family that the species belongs to. Crocodiles have more webbing on the toes of the hind feet and can better tolerate saltwater due to specialized salt glands for filtering out salt, which are present but non-functioning in alligators. Another trait that separates crocodiles from other crocodilians is their much higher levels of aggression."
    },
    {
        "name": "Dear",
        "type": "Mammals",
        "image": "https://pngimg.com/uploads/deer/deer_PNG10176.png",
        "desc2": "Deer (singular and plural) are the ruminant mammals forming the family Cervidae. The two main groups are the Cervinae, including the muntjac, the fallow deer and the chital, and the Capreolinae, including the elk, reindeer (caribou), the Western roe deer, and the Eurasian elk (moose). Female reindeer, and male deer of all species (except the Chinese water deer), grow and shed new antlers each year. In this they differ from permanently horned antelope, which are in the same order, Artiodactyla.",
        "desc3": "The musk deer of Asia and water chevrotain (or mouse deer) of tropical African and Asian forests are not usually regarded as true deer and form their own families: Moschidae and Tragulidae, respectively.",
        "desc": "Deer appear in art from Palaeolithic cave paintings onwards, and they have played a role in mythology, religion, and literature throughout history, as well as in heraldry. Their economic importance includes the use of their meat as venison, their skins as soft, strong buckskin, and their antlers as handles for knives. Deer hunting has been a popular sport since at least the Middle Ages, and remains an important business today."
    },
    {
        "name": "Elephant",
        "type": "Mammals",
        "image": "https://pngimg.com/uploads/elephants/elephants_PNG18798.png",
        "desc2": "Elephants are large mammals of the family Elephantidae and the order Proboscidea. Three species are recognised, the African bush elephant (Loxodonta africana), the African forest elephant (L. cyclotis), and the Asian elephant (Elephas maximus). Elephants are scattered throughout sub-Saharan Africa, South Asia, and Southeast Asia. Elephantidae is the only surviving family of the order Proboscidea; other, now extinct, members of the order include deinotheres, gomphotheres, mammoths, and mastodons. Male African elephants are the largest extant terrestrial animals and can reach a height of 4 m (13 ft) and weigh 7,000 kg (15,000 lb). All elephants have several distinctive features, the most notable of which is a long trunk or proboscis, used for many purposes, particularly breathing, lifting water, and grasping objects. Their incisors grow into tusks, which can serve as weapons and as tools for moving objects and digging. Elephants' large ear flaps help to control their body temperature. Their pillar-like legs can carry their great weight. African elephants have larger ears and concave backs while Asian elephants have smaller ears and convex or level backs.",
        "desc3": "Elephants are herbivorous and can be found in different habitats including savannahs, forests, deserts, and marshes. They prefer to stay near water. They are considered to be keystone species due to their impact on their environments. Other animals tend to keep their distance from elephants while predators, such as lions, tigers, hyenas, and any wild dogs, usually target only young elephants (or 'calves'. Females ('cows') tend to live in family groups, which can consist of one female with her calves or several related females with offspring. The groups are led by an individual known as the matriarch, often the oldest cow. Elephants have a fission–fusion society in which multiple family groups come together to socialise. Males 'bulls' leave their family groups when they reach puberty and may live alone or with other males. Adult bulls mostly interact with family groups when looking for a mate and enter a state of increased testosterone and aggression known as musth, which helps them gain dominance and reproductive success. Calves are the centre of attention in their family groups and rely on their mothers for as long as three years. Elephants can live up to 70 years in the wild. They communicate by touch, sight, smell, and sound; elephants use infrasound, and seismic communication over long distances. Elephant intelligence has been compared with that of primates and cetaceans. They appear to have self-awareness and show empathy for dying or dead individuals of their kind.",
        "desc": "African elephants are listed as vulnerable by the International Union for Conservation of Nature (IUCN) while the Asian elephant is classed as endangered. One of the biggest threats to elephant populations is the ivory trade, as the animals are poached for their ivory tusks. Other threats to wild elephants include habitat destruction and conflicts with local people. Elephants are used as working animals in Asia. In the past, they were used in war; today, they are often controversially put on display in zoos, or exploited for entertainment in circuses. Elephants are highly recognisable and have been featured in art, folklore, religion, literature, and popular culture."
    },
    {
        "name": "Eagle",
        "type": "Birds",
        "image": "https://pngimg.com/uploads/eagle/eagle_PNG1231.png",
        "desc2": "Eagles are large, powerfully built birds of prey, with heavy heads and beaks. Even the smallest eagles, such as the booted eagle (Aquila pennata), which is comparable in size to a common buzzard (Buteo buteo) or red-tailed hawk (B. jamaicensis), have relatively longer and more evenly broad wings, and more direct, faster flight – despite the reduced size of aerodynamic feathers. Most eagles are larger than any other raptors apart from some vultures. The smallest species of eagle is the South Nicobar serpent eagle (Spilornis klossi), at 450 g (0.99 lb) and 40 cm (16 in). The largest species are discussed below. Like all birds of prey, eagles have very large, hooked beaks for ripping flesh from their prey, strong, muscular legs, and powerful talons. The beak is typically heavier than that of most other birds of prey. Eagles' eyes are extremely powerful, having up to 3.6 times human acuity for the martial eagle, which enables them to spot potential prey from a very long distance. This keen eyesight is primarily attributed to their extremely large pupils which ensure minimal diffraction (scattering) of the incoming light. The female of all known species of eagles is larger than the male.",
        "desc3": "Eagles normally build their nests, called eyries, in tall trees or on high cliffs. Many species lay two eggs, but the older, larger chick frequently kills its younger sibling once it has hatched. The dominant chick tends to be a female, as they are bigger than the male. The parents take no action to stop the killing.",
        "desc": "Due to the size and power of many eagle species, they are ranked at the top of the food chain as apex predators in the avian world. The type of prey varies by genus. The Haliaeetus and Ichthyophaga eagles prefer to capture fish, though the species in the former often capture various animals, especially other water birds, and are powerful kleptoparasites of other birds. The snake and serpent eagles of the genera Circaetus, Terathopius, and Spilornis predominantly prey on the great diversity of snakes found in the tropics of Africa and Asia. The eagles of the genus Aquila are often the top birds of prey in open habitats, taking almost any medium-sized vertebrate they can catch. Where Aquila eagles are absent, other eagles, such as the buteonine black-chested buzzard-eagle of South America, may assume the position of top raptorial predator in open areas. Many other eagles, including the species-rich Spizaetus genus, live predominantly in woodlands and forest. These eagles often target various arboreal or ground-dwelling mammals and birds, which are often unsuspectingly ambushed in such dense, knotty environments. Hunting techniques differ among the species and genera, with some individual eagles having engaged in quite varied techniques based their environment and prey at any given time. Most eagles grab prey without landing and take flight with it, so the prey can be carried to a perch and torn apart."
    },
    {
        "name": "Black Snake",
        "type": "Reptiles",
        "image": "https://pngimg.com/uploads/snake/snake_PNG4085.png",
        "desc2": "Snakes are elongated, legless, carnivorous reptiles of the suborder Serpentes that can be distinguished from legless lizards by their lack of eyelids and external ears. Like all squamates, snakes are ectothermic, amniote vertebrates covered in overlapping scales. Many species of snakes have skulls with several more joints than their lizard ancestors, enabling them to swallow prey much larger than their heads with their highly mobile jaws. To accommodate their narrow bodies, snakes' paired organs (such as kidneys) appear one in front of the other instead of side by side, and most have only one functional lung. Some species retain a pelvic girdle with a pair of vestigial claws on either side of the cloaca.",
        "desc3": "ELiving snakes are found on every continent except Antarctica, and on most smaller land masses; exceptions include some large islands, such as Ireland, Iceland, Greenland, the Hawaiian archipelago, and the islands of New Zealand, and many small islands of the Atlantic and central Pacific oceans. Additionally, sea snakes are widespread throughout the Indian and Pacific Oceans. More than 20 families are currently recognized, comprising about 500 genera and about 3,400 species. They range in size from the tiny, 10.4 cm (4.1 in)-long thread snake to the reticulated python of 6.95 meters (22.8 ft) in length.",
        "desc": "The fossil species Titanoboa cerrejonensis was 12.8 meters (42 ft) long. Snakes are thought to have evolved from either burrowing or aquatic lizards, perhaps during the Jurassic period, with the earliest known fossils dating to between 143 and 167 Ma ago. The diversity of modern snakes appeared during the Paleocene period (c 66 to 56 Ma ago). The oldest preserved descriptions of snakes can be found in the Brooklyn Papyrus."
    },
    {
        "name": "Gray Wolf",
        "type": "Mammals",
        "image": "https://pngimg.com/uploads/wolf/wolf_PNG23195.png",
        "desc2": "The gray wolf or grey wolf (Canis lupus[a]), also known as the timber wolf or western wolf,[b] is a canine native to the wilderness and remote areas of Eurasia and North America. It is the largest extant member of its family, with males averaging 43–45 kg (95–99 lb), and females 36–38.5 kg (79–85 lb). Like the red wolf, it is distinguished from other Canis species by its larger size and less pointed features, particularly on the ears and muzzle. Its winter fur is long and bushy, and predominantly a mottled gray in color, although nearly pure white, red, or brown to black also occur. As of 2005, 37 subspecies of C. lupus are recognised by MSW3.",
        "desc3": "The gray wolf is the second most specialised member of the genus Canis, after the Ethiopian wolf, as demonstrated by its morphological adaptations to hunting large prey, its more gregarious nature, and its highly advanced expressive behavior. It is nonetheless closely related enough to smaller Canis species, such as the eastern wolf, coyote, and golden jackal to produce fertile hybrids. It is the only species of Canis to have a range encompassing both the Old and New Worlds, and originated in Eurasia during the Pleistocene, colonizing North America on at least three separate occasions during the Rancholabrean. ",
        "desc": "It is a social animal, travelling in nuclear families consisting of a mated pair, accompanied by the pair's adult offspring. The gray wolf is typically an apex predator throughout its range, with only humans and tigers posing a serious threat to it. It feeds primarily on large ungulates, though it also eats smaller animals, livestock, carrion, and garbage."
    },
    {
        "name": "Turkey Bird",
        "type": "Birds",
        "image": "https://pngimg.com/uploads/turkey/turkey_PNG58610.png",
        "desc2": "The turkey is a large bird in the genus Meleagris, which is native to the Americas. Males of both turkey species have a distinctive fleshy wattle or protuberance that hangs from the top of the beak (called a snood). They are among the largest birds in their ranges. As in many galliformes, the male is larger and much more colorful than the female. Turkeys were domesticated in ancient Mexico, for food and/or for their cultural and symbolic significance. The Aztecs, for example, had a name for the turkey, a word still used in modern Mexico in addition to the general term pavo. Spanish chroniclers, including Bernal Diaz del Castillo and Father Bernardino de Sahagun, describe the multitude of food (both raw fruits and vegetables as well as prepared dishes) that were offered in the vast markets (tianguis) of Tenochtitln, noting there were tamales made of turkey, iguana, chocolate, vegetables, fruit and more. The ancient people of Mexico had not only domesticated the turkey but had apparently developed sophisticated recipes including these ingredients— many used to this day— over hundreds of years .",
        "desc3": "There are two theories for the derivation of the name 'turkey', according to Columbia University professor of Romance languages Mario Pei. One theory is that when Europeans first encountered turkeys in America, they incorrectly identified the birds as a type of guineafowl, which were already being imported into Europe by Turkey merchants via Constantinople and were therefore nicknamed Turkey coqs. The name of the North American bird thus became 'turkey fowl' or 'Indian turkeys', which was then shortened to just 'turkeys'. ",
        "desc": "In 1550, the English navigator William Strickland, who had introduced the turkey into England, was granted a coat of arms including a 'turkey-cock in his pride proper'. William Shakespeare used the term in Twelfth Night, believed to be written in 1601 or 1602. The lack of context around his usage suggests that the term was already widespread ."
    },
    {
        "name": "Shrimp",
        "type": "Amphibians",
        "image": "https://pngimg.com/uploads/shrimps/shrimps_PNG96481.png",
        "desc2": "Shrimp are decapod crustaceans with elongated bodies and a primarily swimming mode of locomotion – most commonly Caridea and Dendrobranchiata. More narrow definitions may be restricted to Caridea, to smaller species of either group or to only the marine species. Under a broader definition, shrimp may be synonymous with prawn, covering stalk-eyed swimming crustaceans with long narrow muscular tails (abdomens), long whiskers (antennae), and slender legs. Any small crustacean which resembles a shrimp tends to be called one. They swim forward by paddling with swimmerets on the underside of their abdomens, although their escape response is typically repeated flicks with the tail driving them backwards very quickly. Crabs and lobsters have strong walking legs, whereas shrimp have thin, fragile legs which they use primarily for perching.",
        "desc3": "Shrimp are widespread and abundant. There are thousands of species adapted to a wide range of habitats. They can be found feeding near the seafloor on most coasts and estuaries, as well as in rivers and lakes. To escape predators, some species flip off the seafloor and dive into the sediment. They usually live from one to seven years. Shrimp are often solitary, though they can form large schools during the spawning season.",
        "desc": "They play important roles in the food chain and are an important food source for larger animals ranging from fish to whales. The muscular tails of many shrimp are edible to humans, and they are widely caught and farmed for human consumption. Commercial shrimp species support an industry worth 50 billion dollars a year, and in 2010 the total commercial production of shrimp was nearly 7 million tonnes. Shrimp farming became more prevalent during the 1980s, particularly in China, and by 2007 the harvest from shrimp farms exceeded the capture of wild shrimp. There are significant issues with excessive bycatch when shrimp are captured in the wild, and with pollution damage done to estuaries when they are used to support shrimp farming. Many shrimp species are small as the term shrimp suggests, about 2 cm (0.79 in) long, but some shrimp exceed 25 cm (9.8 in). Larger shrimp are more likely to be targeted commercially and are often referred to as prawns, particularly in Britain."
    },
    {
        "name": "Jellyfish",
        "type": "Amphibians",
        "image": "https://pngimg.com/uploads/jellyfish/jellyfish_PNG48.png",
        "desc2": "Jellyfish or jellies are softbodied, free-swimming aquatic animals with a gelatinous umbrella-shaped bell and trailing tentacles. The bell can pulsate to acquire propulsion and locomotion. The tentacles may be utilized to capture prey or defend against predators by emitting toxins in a painful sting. Jellyfish species are classified in the subphylum Medusozoa which makes up a major part of the phylum Cnidaria, although not all Medusozoa species are considered to be jellyfish.",
        "desc3": "Jellyfish are found in every ocean, from the surface to the deep sea. Scyphozoans (the 'true jellyfish') are exclusively marine, and some hydrozoans with a similar appearance live in freshwater. Large, often colorful, jellyfish are common in coastal zones worldwide. Jellyfish have roamed the seas for at least 500 million years, and possibly 700 million years or more, making them the oldest multi-organ animal.",
        "desc": "Most jellyfish do not have specialized digestive, osmoregulatory, central nervous, respiratory, or circulatory systems. The manubrium is a stalk-like structure hanging down from the centre of the underside, often surrounded by oral arms, which connects with the mouth/anus at the base of the bell. This opens into the gastrovascular cavity, where digestion takes place and nutrients are absorbed. It is joined to the radial canals which extend to the margin of the bell, where tentacles are attached. Nematocysts, which deliver the sting, are located mostly on the tentacles; scyphozoans also have them around the mouth and stomach. Jellyfish do not need a respiratory system since their skin is thin enough that the body is oxygenated by diffusion. They have limited control over movement, but can use their hydrostatic skeleton to navigate through contraction-pulsations of the bell-like body; some species actively swim most of the time, while others are mostly passive. Depending on the species, the body contains between 95 and 98% water. Most of the umbrella mass is a gelatinous material — the jelly — called mesoglea which is surrounded by two layers of protective skin. The top layer is called the epidermis, and the inner layer is referred to as gastrodermis, which lines the gut."
    },
    {
        "name": "Monkey",
        "type": "Mammals",
        "image": "https://pngimg.com/uploads/monkey/monkey_PNG18737.png",
        "desc2": "Monkeys are non-hominoid simians, generally possessing tails and consisting of about 260 known living species. Many monkey species are tree-dwelling (arboreal), although there are species that live primarily on the ground, such as baboons. Most species are also active during the day (diurnal). Monkeys are generally considered to be intelligent, particularly Old World monkeys.",
        "desc3": "There are two major types of monkey: New World monkeys (platyrrhines) from South and Central America and Old World monkeys (catarrhines of the superfamily Cercopithecoidea) from Africa and Asia. Apes (hominoids)—consisting of gibbons, orangutans, gorillas, chimpanzees, and humans—are also catarrines but are classically distinguished from monkeys. (Tailless monkeys may be called 'apes', incorrectly according to modern usage; thus the tailless Barbary macaque is sometimes called the 'Barbary ape'.) Simians and tarsiers emerged within haplorrhines some 60 million years ago. New World monkeys and catarrhine monkeys emerged within the simians some 35 million years ago. Old World monkeys and Hominoidea emerged within the catarrhine monkeys some 25 million years ago. Extinct basal simians such as Aegyptopithecus or Parapithecus [35-32 million years ago] are also considered monkeys by primatologists.",
        "desc": "Lemurs, lorises, and galagos are not monkeys; instead they are strepsirrhine primates. Like monkeys, tarsiers are haplorhine primates; however, they are also not monkeys."
    },
    {
        "name": "Squid",
        "type": "Amphibians",
        "image": "https://pngimg.com/uploads/squid/squid_PNG1.png",
        "desc2": "Squid are cephalopods of the two orders Myopsida and Oegopsida, which were formerly regarded as two suborders of the order Teuthida, however recent research shows Teuthida to be paraphyletic. The two current orders comprise around 304 species. Like all other cephalopods, squid have a distinct head, bilateral symmetry, a mantle, and arms. Squid, like cuttlefish, have eight arms arranged in pairs and two, usually longer, tentacles.",
        "desc3": "Squid are members of the class Cephalopoda, subclass Coleoidea, the two orders, Myopsida and Oegopsida (including giant squid such as Architeuthis dux). A valid Teuthida would have been the largest cephalopod order with around 300 species classified into 29 families.",
        "desc": "The orders Myopsida and Oegopsida are classified in the superorder Decapodiformes (from the Greek for 'ten legs'). Two other orders of decapodiform cephalopods are also called squid, although they are taxonomically distinct from squids and differ recognizably in their gross anatomical features. They are the bobtail squid of order Sepiolida and the ram's horn squid of the monotypic order Spirulida. The vampire squid, however, is more closely related to the octopuses than to any squid."
    }
]